Concepts of the Python DB API

Connection Objects: 
- Database connections
- Manage transactions

Cursor Objects: 
- Database queries

In [2]:
# Module For Connecting To MySQL database 
import mysql.connector
  
def connect():
    #Connect to MySQL db
    connection = None
    try:
        connection = mysql.connector.connect(host='localhost', database='HR', user='root', password='your_password_here')
        cursor = connection.cursor()
        if connection.is_connected():
            db_Info = connection.get_server_info()
            print("Connected to MySQL version ", db_Info)
            
            cursor.execute("select database();")
            record = cursor.fetchone()
            print("You're connected to database: ", record)
            print('\n')
            
            # Executing Query 
            
            cursor.execute('SELECT * FROM EMPLOYEES;')
            result = cursor.fetchall()
            print(result)
            print('\n')
                       
            #cursor.execute('CREATE TABLE Book(isbn VARCHAR(15) NOT NULL, title VARCHAR(25), PRIMARY KEY (isbn));')
            #result = cursor.fetchall()
            
            #cursor.execute('INSERT INTO Book(isbn, title) VALUES ("The Hobbit", "9780439344471")')
            #result = cursor.fetchall()
                        
            #cursor.execute('SELECT * FROM Book')
            #result = cursor.fetchall()
            #print(result)
            
    except Error as error:
        print(error)
        
    finally:
        if connection is not None and connection.is_connected():
            cursor.close()
            connection.close()
            print("MySQL connection is closed")
    
#Db connection 
db_connection = connect()

Connected to MySQL version  8.0.20
You're connected to database:  ('hr',)


[('E1001', 'John', 'Thomas', '123456', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100', Decimal('100000.00'), '30001', '2\r'), ('E1002', 'Alice', 'James', '123457', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200', Decimal('80000.00'), '30002', '5\r'), ('E1003', 'Steve', 'Wells', '123458', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300', Decimal('50000.00'), '30002', '5\r'), ('E1004', 'Santosh', 'Kumar', '123459', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400', Decimal('60000.00'), '30004', '5\r'), ('E1005', 'Ahmed', 'Hussain', '123410', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500', Decimal('70000.00'), '30001', '2\r'), ('E1006', 'Nancy', 'Allen', '123411', datetime.date(1978, 2, 6), 'F', '111 Green Pl, Elgin,IL', '600', Decimal('90000.00'), '30001', '2\r'), ('E1007', 'Mary', 'Thomas', '123412', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650', Decimal('65000.00'), '30003', '7\r'), ('E1008', 'Bharath', 'Gupta', '123413', datetime.date(1985, 5, 6), 'M', '145 Berry Ln, Naperville,IL', '660', Decimal('65000.00'), '30003', '7\r'), ('E1009', 'Andrea', 'Jones', '123414', datetime.date(1990, 7, 9), 'F', '120 Fall Creek, Gary,IL', '234', Decimal('70000.00'), '30003', '7\r'), ('E1010', 'Ann', 'Jacob', '123415', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220', Decimal('70000.00'), '30004', '5\r')]


MySQL connection is closed

In [5]:
import pandas as pd

connection = mysql.connector.connect(host='localhost', database='HR', user='root', password='your_password_here')
df = pd.read_sql('SELECT * FROM DEPARTMENTS', connection)
df.head()

  DEPT_ID_DEP         DEP_NAME MANAGER_ID   LOC_ID
0           2  Architect Group      30001  L0001\r
1           5   Software Group      30002  L0002\r
2           7      Design Team      30003  L0003\r
3           5   Software Group      30004  L0004\r

In [13]:
df.describe()

       DEPT_ID_DEP        DEP_NAME MANAGER_ID   LOC_ID
count            4               4          4        4
unique           3               3          4        4
top              5  Software Group      30004  L0002\r
freq             2               2          1        1

In [14]:
df.shape

(4, 4)

In [15]:
connection.close()